app/controllers/posts_controller.rb

  def index
    @post = Post.all
---
SELECT "posts".* FROM "posts"

  def update
    @post = Post.find(params[:id])
    if(@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Second Title"], ["body", "Second article."], ["updated_at", "2020-06-01 20:29:40.483290"], ["id", 2]]

  def create
    # render plain: params[:post].inspect
    @post = Post.new(post_params)

    if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Title"], ["body", "First article."], ["created_at", "2020-06-01 19:26:54.633203"], ["updated_at", "2020-06-01 19:26:54.633203"]]